WF/src/Documents/ПКО/ПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПКО</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccountingRegister.БухгалтерскиеПроводки</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
</mdclass:Document>

WF/src/AccountingRegisters/БухгалтерскиеПроводки/БухгалтерскиеПроводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>БухгалтерскиеПроводки</name>
  <chartOfAccounts>ChartOfAccounts.ПланыСчетовБухгалтерии</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

WF/src/ChartsOfAccounts/ПланыСчетовБухгалтерии/ПланыСчетовБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланыСчетовБухгалтерии</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

WF/src/Documents/ПКО/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		ИтоговаяСумма = ДанныеЗаполнения.ИтоговаяСумма;
		Поставщик = ДанныеЗаполнения.Поставщик;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БухгалтерскиеПроводки 
	Движения.БухгалтерскиеПроводки.Записывать = Истина;
	Движение = Движения.БухгалтерскиеПроводки.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Покупатели;
	Движение.Период = Дата;
	Движение.Сумма = ИтоговаяСумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
